# 2.6 특정 열 선택하기

인덱스 값으로 선택하기
- 모든 파일에 열의 값이 고정된 경우
- 어떤 열이 어떤 위치에 있는지 식별하기 쉬운 경우
- 한 번에 여러 값을 처리해야 할 경우

헤더를 사용해 선택하기
- 파일마다 특정 열의 위치가 다른 경우
- 특정 열 이름으로 찾는다
- 코드에서는 해당 이름을 가진 컬럼을 찾은 후, 그 열의 인덱스로 값을 찾는다

판다스
- .iloc[:,#,#] : 정수 값(위치) <integer? index? location>
- .lic : lable <location>

- data_frame.iloc[:(행에 대한 선택),[1,3,5] (열에 대한 선택)] 
- data_frame.iloc[:, start_index:end_index] 

- data_frame.loc[:, 'A'] 
- data_frame.loc[0:5, ['A','C']
- data_frame.loc[:, 'A':'F']

In [1]:
% pwd

'/Users/8percent_1502/Dropbox/mirror/github/analytics-with-python'

In [2]:
% ls

11csv_read_select_contiguous_rows.py
11output.csv
11pandas_output.csv
12csv_reader_add_header.py
12output.csv
12pandas_output.csv
1_9_practice.py
1csv_read_with_simple_parsing_and_write.py
1output.csv
2.6.ipynb
20171220_deal_data.csv
2csv_reader_parsing_and_write.py
2output.csv
6csv_reader_column_by_index.py
7csv_reader_column_by_name.py
7output.csv
7pandas_output.csv
8csv_reader_counts_for_multiple_files.py
9csv_reader_concat_rows_from_multiple_files.py
9output.csv
9pandas_output.csv
another_file_to_read.txt
dealapp_data_180108.csv
deals_dec_2017.csv
deals_nov_2017.csv
deals_oct_2017.csv
file_to_read.txt
first_script.ipynb
first_script.py*
output6.csv
pandas_add_header_row.py
pandas_column_by_index.py
pandas_column_by_name.py
pandas_concat_rows_from_multiple_files.py
pandas_output.csv
pandas_parsing_and_write.py
supplier_data_no_header_row.csv
supplier_data_unnecessary_header_footer.csv
write_to_file.csv
write_to_file.txt

In [3]:
import pandas as pd

In [39]:
df = pd.read_csv('./deals_dec_2017.csv')

In [40]:
df.head()

   deal_id               title  index_num     amount        date
0     5755           합정 빌라 재계약       5116   15980000  2017.12.28
1     5621               한솔프라임       4982  199970000  2017.12.19
2     5526             강남구 아파트       4899   71970000  2017.12.11
3     5668            더 뮤지컬 1호       5028  399780000  2017.12.22
4     5603  트리플에스(Triple-S) 2차       4967   99710000  2017.12.18

In [41]:
type(df['title'])

pandas.core.series.Series

In [42]:
df.loc[:5,['title','amount','date']]

                title     amount        date
0           합정 빌라 재계약   15980000  2017.12.28
1               한솔프라임  199970000  2017.12.19
2             강남구 아파트   71970000  2017.12.11
3            더 뮤지컬 1호  399780000  2017.12.22
4  트리플에스(Triple-S) 2차   99710000  2017.12.18
5     농협 IoT 스마트판매시스템  299990000  2017.12.12

In [17]:
df.loc[[0,1,3,6],['title','amount','date']]

       title     amount        date
0  합정 빌라 재계약   15980000  2017.12.28
1      한솔프라임  199970000  2017.12.19
3   더 뮤지컬 1호  399780000  2017.12.22
6       더존푸드  149760000  2017.12.14

In [22]:
df.sort_values('amount')

   deal_id               title  index_num     amount        date
0     5755           합정 빌라 재계약       5116   15980000  2017.12.28
2     5526             강남구 아파트       4899   71970000  2017.12.11
4     5603  트리플에스(Triple-S) 2차       4967   99710000  2017.12.18
6     5580                더존푸드       4934  149760000  2017.12.14
1     5621               한솔프라임       4982  199970000  2017.12.19
7     4897        달서미즈맘병원(재모집)       4261  297800000   2017.12.4
8     5729            더 뮤지컬 2호       5089  299780000  2017.12.28
5     5552     농협 IoT 스마트판매시스템       4915  299990000  2017.12.12
3     5668            더 뮤지컬 1호       5028  399780000  2017.12.22

In [24]:
df.loc[:,'date']

0    2017.12.28
1    2017.12.19
2    2017.12.11
3    2017.12.22
4    2017.12.18
5    2017.12.12
6    2017.12.14
7     2017.12.4
8    2017.12.28
Name: date, dtype: object

In [27]:
df['yearmonth'] = df.date.apply(lambda x: x[0:7])
# date 칼럼을 기준으로 yearmonth라는 칼럼을 추가한다 (lambda 활용 - 7번째 문자까지 인용)

In [28]:
df.date[0][0:7]

'2017.12'

In [29]:
df

   deal_id               title  index_num     amount        date yearmonth
0     5755           합정 빌라 재계약       5116   15980000  2017.12.28   2017.12
1     5621               한솔프라임       4982  199970000  2017.12.19   2017.12
2     5526             강남구 아파트       4899   71970000  2017.12.11   2017.12
3     5668            더 뮤지컬 1호       5028  399780000  2017.12.22   2017.12
4     5603  트리플에스(Triple-S) 2차       4967   99710000  2017.12.18   2017.12
5     5552     농협 IoT 스마트판매시스템       4915  299990000  2017.12.12   2017.12
6     5580                더존푸드       4934  149760000  2017.12.14   2017.12
7     4897        달서미즈맘병원(재모집)       4261  297800000   2017.12.4   2017.12
8     5729            더 뮤지컬 2호       5089  299780000  2017.12.28   2017.12

In [30]:
df.amount > 100000000

0    False
1     True
2    False
3     True
4    False
5     True
6     True
7     True
8     True
Name: amount, dtype: bool

In [38]:
df.loc[df.amount > 100000000, :][['title','amount']]

             title     amount
1            한솔프라임  199970000
3         더 뮤지컬 1호  399780000
5  농협 IoT 스마트판매시스템  299990000
6             더존푸드  149760000
7     달서미즈맘병원(재모집)  297800000
8         더 뮤지컬 2호  299780000

In [35]:
df.groupby('yearmonth').amount.sum()

yearmonth
2017.12    1834740000
Name: amount, dtype: int64

In [34]:
df.groupby('yearmonth').amount.mean()

yearmonth
2017.12    203860000
Name: amount, dtype: int64

In [37]:
df.columns

Index(['deal_id', 'title', 'index_num', 'amount', 'date', 'yearmonth'], dtype='object')

In [ ]:
df.merge(df, df_month_name, on = 'yearmonth')